{
  "title": "Matrix Hackathon Demo Voiceover (EN)",
  "project": "Jackpot SocialFi Roulette",
  "language": "en",
  "target_duration_sec": 130,
  "usage_notes": {
    "for_tts": "Use VIDEO_VOICEOVER_2MIN_EN_TTS.txt for direct text-to-speech generation.",
    "for_llm_or_editor": "Use this file to preserve timing, screen direction, and narration structure.",
    "timing_behavior": "Timestamps are editorial targets for video assembly, not guaranteed by TTS engines."
  },
  "segments": [
    {
      "id": 1,
      "start": "00:00",
      "end": "00:15",
      "screen": [
        "Home page (/) overview",
        "Visible: current pot, probability wheel, deposit panel",
        "Wide UI sweep, no clicks yet"
      ],
      "voiceover": "Hi, this is our Matrix Hackathon project: a fair, open, on-chain SocialFi jackpot on Solana. We combine provably fair game mechanics, real DeFi assets, and degen-first UX."
    },
    {
      "id": 2,
      "start": "00:15",
      "end": "00:35",
      "screen": [
        "DepositPanel on Home",
        "Token selector (example: SOL or another token)",
        "Amount input + Jupiter quote preview (X -> USDC via Jupiter)",
        "Click DEPOSIT or DEPOSIT BATCH (...)",
        "Optional: Phantom signature popup(s)"
      ],
      "voiceover": "Players can join a round not only with USDC, but with other supported tokens as well. We use Jupiter to route and swap those assets into USDC before entering the jackpot. So DeFi actions are part of the game loop itself, not just a side integration."
    },
    {
      "id": 3,
      "start": "00:35",
      "end": "00:55",
      "screen": [
        "Home after deposit",
        "Show pot updates, Your Chance, ParticipantsList, JackpotWheel",
        "Briefly show chat/live activity",
        "Switch to Round Detail/history entry",
        "Show Provably Fair / VRF randomness section",
        "Alternative: Solscan round-related proof fields"
      ],
      "voiceover": "Once players join, they see the live pot, real-time odds, the probability wheel, and social activity. Winner selection is powered by VRF, so outcomes are provably fair and verifiable on-chain. Fairness, on-chain transparency, and openness are core product principles for us."
    },
    {
      "id": 4,
      "start": "00:55",
      "end": "01:15",
      "screen": [
        "WinnerModal",
        "Toggle USDC / DEGEN MODE",
        "Show hidden token preview behavior (Hidden until claim) in VRF-seeded mode",
        "Click CLAIM DEGEN",
        "Show Phantom windows for two signatures (claim + swap)"
      ],
      "voiceover": "Winners can claim in classic USDC mode, or use Degen Mode. In our current lite degen mode, the token is deterministically derived from the round VRF, with no reroll, and then swapped via Jupiter after claim. This makes the degen UX much fairer than simple frontend randomness."
    },
    {
      "id": 5,
      "start": "01:15",
      "end": "01:35",
      "screen": [
        "Batch UI in DepositPanel",
        "Show Add to Batch, Batch (N/N), DEPOSIT BATCH",
        "If available, show progress text: Preparing batch deposit..., Sending batch part ...",
        "Optional: oversized batch example and auto-split behavior"
      ],
      "voiceover": "We also built a multi-token batch deposit MVP. If a user wants to enter with multiple tokens, the app can batch the flow. And if the transaction becomes too large for Solana packet limits, we automatically split it into multiple transactions and show progress to the user."
    },
    {
      "id": 6,
      "start": "01:35",
      "end": "01:50",
      "screen": [
        "Terminal with passing tests (npm test)",
        "MAINNET_AUDIT.md and OPS_RUNBOOK.md snippets",
        "addresses.mainnet.json snippet (Ops/Upgrade multisig + timelock)",
        "Optional: Squads tx screenshots/logs"
      ],
      "voiceover": "This is not just a UI prototype. We have Anchor tests for on-chain logic, frontend and crank tests, mainnet smoke checks, and Squads multisig governance for admin and upgrade safety. We want degen UX on top of a safe and auditable protocol core."
    },
    {
      "id": 7,
      "start": "01:50",
      "end": "02:10",
      "screen": [
        "Roadmap slide with large readable bullets",
        "Optional backing visuals: README_JUDGES_MATRIX.md or product UI",
        "Final shot: Home page plus project name/logo"
      ],
      "voiceover": "Our roadmap includes a strict on-chain degen claim flow, reduced degen fees, Pinocchio migration for hot paths, ATA cleanup UX, missions with JUP rewards, referral rewards with low-cost payout rails, Solana Actions for AI agents, Solana Blinks, clans, custom rooms, and sponsored single-coin rooms. Our focus is fair, on-chain, open, SocialFi-native gameplay with degen energy and nearly unlimited monetization formats."
    }
  ],
  "short_edit_timeline": [
    {
      "start": "00:00",
      "end": "00:20",
      "screen": "Home overview (pot / wheel / deposit)"
    },
    {
      "start": "00:20",
      "end": "00:40",
      "screen": "Jupiter deposit flow"
    },
    {
      "start": "00:40",
      "end": "01:00",
      "screen": "Social UI (participants, chat, history)"
    },
    {
      "start": "01:00",
      "end": "01:20",
      "screen": "VRF / provably fair details (RoundDetail or Solscan)"
    },
    {
      "start": "01:20",
      "end": "01:40",
      "screen": "WinnerModal + degen mode + two-signature flow"
    },
    {
      "start": "01:40",
      "end": "02:00",
      "screen": "Batch deposit + tests/smoke/multisig snippets + roadmap slide"
    }
  ]
}
